HighCodeh/TentacleOS/firmware_p4/sdkconfig.defaults
# Chip target (also set in CMakeLists.txt; kept here so a bare cmake/extension
# configure can't fall back to the esp32 default)
CONFIG_IDF_TARGET="esp32p4"

# Flash — 8MB, DIO, 20MHz (conservative clock for marginal V1.x/FFC hardware)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_20M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Custom partition table (with OTA)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback support in bootloader
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Chip revision — this silicon is v1.3, so target the <v3.0 P4 family
# (rev <3.0 and >=3.0 are mutually exclusive in IDF). Range becomes v1.0–v1.99.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# CPU 360MHz (P4 maximum)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Build the whole app + IDF at -O2 (perf) instead of the -Og default. The LVGL
# software renderer is fully CPU-bound, so this is the biggest transparent speed
# win (identical output). Assertions stay on (ASSERTIONS_ENABLE) for safety.
# Trade-off: harder step-debugging; flip back to _DEBUG for interactive debug.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set

# PSRAM hex-octal mode, 200MHz - P4 specific (V3 prototype has PSRAM populated)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# Allow static .bss to live in PSRAM (via EXT_RAM_BSS_ATTR). The UI screens keep
# large static list buffers (image_viewer file list, gb paths, ir/wav lists, ...)
# that were pinning ~200-300 KB of the scarce internal DRAM; moving them to PSRAM
# with EXT_RAM_BSS_ATTR is what needs this on.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Larger stack for kernel_init
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Primary console UART0, secondary USB JTAG
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set (P4: USJ unreachable behind the mux, unused)
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# TinyUSB HID — 2 interfaces (keyboard + mouse) for Bad USB
CONFIG_TINYUSB_HID_COUNT=2
CONFIG_TINYUSB_MODE_DMA=y

# TinyUSB CDC-ACM — companion host link (composite alongside the HID)
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096

# Required for sys_monitor (uxTaskGetSystemState / vTaskList)
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# LVGL fonts used by UI components
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y

# LVGL tuning: clib malloc routes blocks above SPIRAM_MALLOC_ALWAYSINTERNAL (2 KB)
# to PSRAM, so the decoded image cache (menu icons ~3 KB, frames ~150 KB) lands in
# PSRAM instead of starving the internal DMA RAM the SPI bridge and LCD need.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_CACHE_DEF_SIZE=1048576
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=65
CONFIG_LV_FS_POSIX_PATH="/"
CONFIG_FREERTOS_HZ=1000

# SD is native 512-byte sectors; 4096 wastes ~40KB of internal heap on FATFS buffers
CONFIG_FATFS_SECTOR_512=y
CONFIG_WL_SECTOR_SIZE_512=y
# Long filenames on SD (TOS folder tree uses names >8.3, e.g. captive_portal, screen.conf)
CONFIG_FATFS_LFN_HEAP=y

# Default log level INFO
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# HKDF for the companion host-link key derivation (disabled by default in IDF)
CONFIG_MBEDTLS_HKDF_C=y

# LVGL QR code widget — companion pairing screen renders the PSK as a QR
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_GIF=y
CONFIG_LV_USE_TJPGD=y

# LVGL snapshot — NFC card-emulation screen snapshots a panel to animate it
CONFIG_LV_USE_SNAPSHOT=y

# Task WDT reboots (panics) instead of only warning when a task starves a core's
# idle task or a subscribed task stops feeding it. Safe now that the OTA and C5
# flash write loops yield per chunk and the UI task probes the LVGL lock.
CONFIG_ESP_TASK_WDT_PANIC=y

# Power management (esp_pm light sleep) is OFF: on this board it breaks the
# console UART RX even with DFS disabled (light sleep pauses the CPU and the IDF
# console-UART wakeup path did not recover it on the P4). Re-enabling needs
# on-bench iteration (UART wake source, per-resource NO_LIGHT_SLEEP locks). The
# big power wins - C5 radio off when idle, screen dim/off, ship mode - do not
# depend on this. Infra is kept (Service/power_manager, screen gate) for later.
# CONFIG_PM_ENABLE is not set
# CONFIG_FREERTOS_USE_TICKLESS_IDLE is not set

# Core dump to the dedicated flash partition (ELF format) for field forensics.
# On a panic the backtrace/registers/task stacks are saved; the boot report reads
# and clears the image via esp_core_dump_* (see Service/boot_report).
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_STACK_SIZE=1792

# Hold the panic backtrace on the serial line for 2 s before rebooting, so field
# debugging can read it instead of it scrolling past with the next boot.
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=2

